Revit 2027 API
ParameterTypeId.MeasureFromStructure Property
 "Extend into wall (to core)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MeasureFromStructure { get; }
Public Shared ReadOnly Property MeasureFromStructure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MeasureFromStructure {
	ForgeTypeId^ get ();
}
static member MeasureFromStructure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace